apps/openfoam/stampede/2.4.0_mvapich2/test/testInput/0/boundary
FoamFile
{
    version     2.0;
    format      ascii;
    class	file;
    object	boundary;
}
    lowerwall
    {
  type    symmetryPlane;    }

    upperwall
    {
  type	symmetryPlane;    }

    frontAndBack
    {
        type            empty;
    }


