apps/openfoam/stampede/2.4.0_mvapich2/test/testInput/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     pisoFoam;

startFrom       startTime;

startTime       0;

stopAt          endTime;

endTime         100;

deltaT          0.01;

writeControl    runTime;

writeInterval   10;

purgeWrite      0;

writeFormat     ascii;

writePrecision  6;

writeCompression compressed;

timeFormat      general;

timePrecision   8;

runTimeModifiable yes;

functions
(
forceCoeffs
{
	type forceCoeffs;
	outputControl   timeStep;
	outputInterval  1;
	log off;
	functionObjectLibs ("libforces.so");
	patches (object);
	rhoName rhoInf;
	rhoInf 1;
	CofR (0 0 0);
	liftDir (0 1 0);
	dragDir (1 0 0);
	pitchAxis (0 0 1);
	magUInf 1;
	lRef 1;
	Aref 1;
}

fieldAverage
{
type            fieldAverage;
functionObjectLibs ("libfieldFunctionObjects.so");
enabled         true;
outputControl   outputTime;
fields
(
 U
{

 mean        on;
 prime2Mean  on;
 base        time;
 }
 p
{

 mean        on;
 prime2Mean  on;
 base        time;
 }
 );
}

wallPressure
{
	type            surfaces;
	functionObjectLibs ("libsampling.so");
	outputControl   outputTime;
	surfaceFormat   raw;
	fields
	(
		pMean
	);
	interpolationScheme cellPoint;

	surfaces
	(
		object
		{
			type        patch;
			patches     (object);
			triangulate false;
		}
	);
}wallPressureFlux
{
	type            surfaces;
	functionObjectLibs ("libsampling.so");
	outputControl   outputTime;
	surfaceFormat   raw;
	fields
	(
		pPrime2Mean
	);
	interpolationScheme cellPoint;

	surfaces
	(
		object
		{
			type        patch;
			patches     (object);
			triangulate false;
		}
	);
});

// ************************************************************************* //
