apps/openfoam/stampede/2.4.0_mvapich2/test/testInput/system/sampleDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      sampleDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

interpolationScheme cellPointFace;

setFormat       raw;
surfaceFormat raw;

fields
(
    //pMean
    //pPrime2Mean
    UMean
    //UPrime2Mean
);

sets
(
wakeCenter
{
	type        uniform;
	axis        x;
        start       (0.00 0.00 0.50);
	end         (18 0.00 0.50);
	nPoints     500;
}
);

